{
    "version": "0.1.0b",
    "date": "10/03/2023",
    "removals": [
        "Removed the 'firstLaunch' property from the 'settings' object in the 'settings.json' file."
    ],
    "additions": [
        "Added the 'update.xml' file to contain the 'firstLaunch' property.",
        "Added the 'changelog.json' file to contain the changelog.",
        "Added an changelog window that will open when the program is launched for the first time after an update or when click on the icon next to the version (upper right).",
        "Added the ability to drag and drop the items needed in the carrack tracker.",
        "You can now use a \"+\" in the search bar to search for multiple item (example: \"blue candle bundle +ancient orders\").",
        "Added some advices, look at the right of the navigation bar.",
        "Added an arrow to the tracker components bar, to show you that you can click on to open them.",
        "Added many new items to the Carrack tracker.",
        "Added many translation lines.",
        "Added an window to check the integrity of the data files and if an update is available.",
        "Added some animations to make the program more interactive.",
        "Added the disclaimer (can be find in the \"?\" icon).",
        "Added an advice system to help you to use the program."
    ],
    "fixes": [
        "Fixed the need to delete all data file every time that we update the program data. Now it will automatically adjust to the new data structure.",
        "Fixed some problem with the language selection window. Now it should work properly.",
        "Now you can CTRL + A and other shortcuts in the number input field in the carrack - inventory section.",
        "Resize of the window to fit the content.",
        "Change the icon of the filter in the barter section.",
        "Augmented the size of the clickable area on the number input in the bartter section.",
        "Fixed some problem with the threshold (The threshold was not applied when the value was empty unless you switched between barter and carrack)",
        "Fixed some problem with the total value (incorrect value).",
        "Fixed the auto-sizing of the text in the barter section.",
        "Now the disclaimer and the language selection window will not be displayed every time that you update the program."
    ],
    "notes": [
        "The program will - NORMALY - automatically update itself when you launch it. But I can't guarantee that it will work properly. If you have any problem, please look in the GitHub for a new version.",
        "The verification of all the data files is in test, so if you find any problem, please report it on GitHub.",
        "This software is still in development, so if you find any problem, please report it on GitHub. Thank you!"
    ]
}